app/controllers/students_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ?  [["student_id", 1]]
---
  def show
    @scores = Score.where(student_id: params[:id])

UPDATE "students" SET "dob" = ?, "student_no" = ?, "class_year" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["dob", "2022-09-14"], ["student_no", "1112"], ["class_year", 2022], ["updated_at", "2022-09-22 07:15:19.288920"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)